


class Keywords:
    goodwin = ['востановил позицию', 'кто ранее не брал ', 'кто не брал ранее', 'есть сила расти', 'докупил',
               'сильно выглядит', 'выглядит симпатично', 'выглядит сильно', 'увеличил позицию', 'выглядит интересно',
               'сегодня также актуальна', 'можно рассмотреть', 'нравиться как выглядит', 'взял также', 'беру в докупку',
               'шикарно выглядит', 'жду роста', 'жду здравого роста', 'взял на среднесрок', 'взял также', 'выглядит для покупки',
               'можно взять', 'интересно выглядит', 'добрал позицию', 'также взять', 'также взял', 'взял акции',
               'решил зайти', 'сильно держиться', 'можно присмотреться', 'добавил позицию', 'позицию добавил', 'решил добрать',
               'сильно выглядит', 'можно докупить', 'добавил покупку']