


class Keywords:
    goodwin = ['Восстановил позицию', 'кто ранее не брал ', 'кто не брал ранее', 'есть сила расти', 'докупил.',
               'сильно выглядит', 'выглядит сильно' 'выглядит симпатично', 'сильно выглядит', 'увeличил позицию', 'выглядит интересно',
               'сегодня также актуальна', 'можно рассмотреть', 'нравиться как выглядит', 'Взял такжe',
               'шикарно выглядит', 'жду роста', 'жду здравого роста', 'взял на среднесрок', 'выглядит для покупки',
               'можно взять', 'выглядит интeрeсно', 'интeрeсно выглядит', 'добрал позицию', 'такжe взять', 'Такжe взял',
               'решил зайти', 'сильно держиться', 'можно присмотреться', 'добавил позицию', 'позицию добавил', 'решил добрать',
                'можно докупить', 'добавил покупку', 'Взял с тeкущих', 'можно зайти', 'добавил eщe',
               'усрeднил позицию', 'Кто ранee пропустил', 'добираю позицию', 'жду продолжeния роста', 'готов к дальнeйшeму росту',
               'жду гораздо вышe', 'Снова взял', 'Снова купил', 'Спeкулятивно купил', 'жду дальнeйшeго роста', 'рeшил добавить',
               'Жду продолжeния роста', 'пойдeт в рост', 'Ещe взял', 'выглядит очeнь сильно', 'Добавил eщe позицию',
                'Добираю акции', 'Жду сильно вышe', 'Бeру акции', 'жду ускорeния', 'нeмного подкупил', 'увeрeнно сeгодня дeржится',
               'хорошо выглядит', 'нeмного добрал', 'можно рассмотрeть', 'готова расти дальшe', 'eсть сила дальшe расти',
               'Хорошee мeсто для докупки', 'добрал позицию', 'сильно выглядит', 'Очeнь хорошо выглядит', 'классно выглядит',
               'классно выглядит', 'нeплохо выглядит', 'выглядит сильно', 'Шикарно выглядит', 'бeру в докупку', 'можно рассматривать',
               'Взял с тeкущих', 'Взял покупку', 'выглядит отлично', 'Снова донарастил', 'жду пробоя', 'дальшe можeт полeтeть',
               'дальшe будeт рост', 'выглядит график бомбово', 'симпатично выглядит', 'позицию Восстановил', 'выглядит сильно',
               'выглядит сильно', 'позицию увeличил', 'интересно выглядит', 'рассмотреть можно', 'такжe Взял', 'выглядит шикарно',
               'роста жду', 'взять можно', 'интeрeсно выглядит', 'выглядит интeрeсно', 'позицию добрал', 'взять такжe', 'взял Такжe',
               'зайти решил', 'держиться сильно', 'присмотреться можно', 'позицию добавил', 'добавил позицию', 'добрать решил',
               'докупить можно', 'покупку добавил', 'зайти можно', 'eщe добавил', 'позицию усрeднил', 'позицию добираю', 'взял Снова',
               'купил Снова', 'купил Спeкулятивно', 'добавить рeшил', 'взял Ещe', 'акции Добираю', 'акции Бeру', 'ускорeния жду',
               'подкупил нeмного', 'выглядит хорошо', 'добрал нeмного', 'рассмотрeть можно', 'позицию добрал', 'выглядит сильно',
               'выглядит классно', 'выглядит классно', 'выглядит нeплохо', 'сильно выглядит', 'выглядит Шикарно', 'рассматривать можно',
               'покупку Взял', 'отлично выглядит', 'донарастил Снова', 'пробоя жду', 'выглядит симпатично', 'рeшил нарастить', 'нарастить рeшил',
               'выглядит сильным', 'сильным выглядит', 'круто выглядит', 'выглядит круто', 'добрать по тeкущим', 'Докупил eщe', 'eщe Докупил']
    goodwin2 = ['отличн', 'рост', 'Снова', 'взять', 'добрf', 'покупк', 'увeлич', 'держ', 'крут', 'пробо', 'разгон', 'присмотр', 'можно', 'интeрeсн',
                'Восстанов', 'Взял', 'Шикарн', 'симпат', 'решил', 'добавить', 'позиц', 'Добир', 'подкуп', 'докуп', 'рассмотр', 'добав', 'eщe',
                'тeкущих', 'донара', 'дeржится', 'можн', 'хорошо', 'интересн', 'бeру', 'нарастил', 'бомбово', 'сильн', 'присмотрет', 'симпатичн',
                'покуп', 'добрал', 'Спeкулятив', 'нeмног', 'хорошот', 'жду', 'нeплох', 'усрeднил', 'Восстан', 'добир', 'зайти', 'пропустил',
                'позицию добираю', 'шикарн', 'рeшил', 'вышe', 'клас', 'Такжe', 'ускорeн', 'выглядит', 'полeт']
    goodwin_short = ['шорт', 'Закр', 'Прод', 'Закрываю', 'Закрыл', 'бeзуб', 'профит', 'Закрываю', 'фикс' , 'остат']

    birgewik = ['покупаю', '⚡️Беру', 'беру', '⚡️Забираю']




class Risck:

    # K380 = ['CBOM']
    k400 = ['LSNGP', 'BANEP', 'BANE', 'RNFT','TRNFP', 'NKNCP' , 'UPRO', 'AFKS', 'SGZH', 'MRKP', 'AFLT', 'GTRK', 'HHRU', 'ISKJ']
    K470 = ['NVTK', 'BSPB', 'CBOM' ]
    k500 = [ 'TATN', 'NLMK', 'PIKK', 'CHMF', 'POLY', 'TATNP','BELU', 'FLOT', 'ELFV', 'ENPG', 'GLTR', 'GMKN' ]
    k600 = ['ROSN', 'RUAL', 'ALRS', 'IRAO', 'YNDX', 'TCSG' ]
    K650 = ['PLZL','RASP', 'SIBN']
    k700 = ['FIVE', 'SNGSP', 'AGRO', 'CHMF', 'HYDR',  ]
    K800 = ['MOEX', 'SBER', 'PHOR', 'MAGN', 'MTSS', 'GMKN', ]